Файлы_конфигурации/Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЕдиницыИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Файлы_конфигурации/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Файлы_конфигурации/Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупательИПродавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Файлы_конфигурации/Documents/ЗаказПоставщику/Ext/ObjectModule.bsl
//Вычисление СуммыДокумента перед записью
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	//Чтобы нельзя было поправить сумму документа перед записью документа
	СуммаДокумента=Таблица.Итог("Сумма");
	
КонецПроцедуры

// Движение в регистр ЗаказыПоставщикам Приход
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗаказыПоставщикам Приход
	Движения.ЗаказыПоставщикам.Записывать = Истина;
	Для Каждого ТекСтрокаТаблица Из Таблица Цикл
		Движение                          = Движения.ЗаказыПоставщикам.Добавить();
		Движение.ВидДвижения              = ВидДвиженияНакопления.Приход;
		Движение.Период                   = Дата;
		Движение.Организация              = Организация;
		Движение.Контрагент               = Контрагент;
		Движение.Договор                  = Договор;
		Движение.ЗаказПоставщику          = Ссылка; //ЭтотОбъект;
		Движение.Номенклатура             = ТекСтрокаТаблица.Номенклатура;
		Движение.ВариантНоменклатуры      = ТекСтрокаТаблица.НаборСвойств;
		Движение.Количество               = ТекСтрокаТаблица.Количество*ТекСтрокаТаблица.КоэффициентЕдиницыИзмерения;
		Движение.Сумма                    = ТекСтрокаТаблица.Сумма;
	КонецЦикла;

	
КонецПроцедуры

//Ввод на основании справочника Контрагенты и Номенклатура, ВариантНоменклатуры
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда 
		
		Если ДанныеЗаполнения.ЭтоГруппа Тогда
			
			Сообщение       = Новый СообщениеПользователю();
			Сообщение.Текст = "Поле  <<Контрагент>> не заполнено. Была выбрана Группа <<" + ДанныеЗаполнения + ">>, а не конкретный продавец!";
			Сообщение.Поле  = "Контрагент";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
		ИначеЕсли ДанныеЗаполнения.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель Тогда	
			
			Сообщение       = Новый СообщениеПользователю();
			Сообщение.Текст = "Поле  <<Контрагент>> не заполнено. Выбранный контрагент <<" + ДанныеЗаполнения + ">> является Покупателем, а не Продавцом!";
			Сообщение.Поле  = "Контрагент";
			Сообщение.УстановитьДанные(ЭтотОбъект);                                                                            
			Сообщение.Сообщить();
			
		Иначе
			
			// Заполнение шапки
			Контрагент      = ДанныеЗаполнения;
			ОбъектОснование = ДанныеЗаполнения;
			
			Сообщение       = Новый СообщениеПользователю();
			Сообщение.Текст = "Поле  <<Контрагент>> заполнено: <<" + ДанныеЗаполнения + ">> ";
			Сообщение.Поле  = "Контрагент";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Если ДанныеЗаполнения.ЭтоГруппа Тогда
			
			Сообщение       = Новый СообщениеПользователю();
			Сообщение.Текст = "Колонка <<Номенклатура>> не заполнена. Была выбрана Группа <<" + ДанныеЗаполнения + ">>, а не конкретная номенклатура!";
			Сообщение.Поле  = "Таблица.Номенклатура";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		Иначе
			
			// Заполнение шапки
			Контрагент               = ДанныеЗаполнения.Поставщик;
			ОбъектОснование          = ДанныеЗаполнения;
			
			НоваяСтрока              = Таблица.Добавить();
			НоваяСтрока.Номенклатура = ДанныеЗаполнения;
			
			Сообщение                = Новый СообщениеПользователю();
			Сообщение.Текст          = "Колонка <<Номенклатура>> заполнена. Была выбрана номенклатура <<" + ДанныеЗаполнения + ">>.";
			Сообщение.Поле           = "Таблица[0].Номенклатура";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ВариантыНоменклатуры") Тогда
		
		// Заполнение шапки
		Контрагент               = ДанныеЗаполнения.Владелец.Поставщик;
		ОбъектОснование          = ДанныеЗаполнения;
		
		НоваяСтрока              = Таблица.Добавить();
		НоваяСтрока.Номенклатура = ДанныеЗаполнения.Владелец;
		НоваяСтрока.НаборСвойств = ДанныеЗаполнения;
		
		Сообщение                = Новый СообщениеПользователю();
		Сообщение.Текст          = "Колонки <<Номенклатура>> и <<НаборСвойств>> заполнены:  <<" + ДанныеЗаполнения.Владелец + ">> и <<" + ДанныеЗаполнения + ">>.";
		Сообщение.Поле           = "Таблица[0].Номенклатура";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры
